//Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
int numberA = new Random().Next(10,99);
int result = numberA;
Console.WriteLine(result);